<?php
return array(
    // +----------------------------------------------------------------------
    // | 数据库设置
    // +----------------------------------------------------------------------
    
    'type'				=>  'mysql',            // 数据库类型
    'hostname'			=>  '0.0.0.0',        // 服务器地址
    'database'			=>  'dbname',      // 数据库名
    'username'			=>  'user',             // 用户名
    'password'			=>  '123',             // 密码
    'hostport'			=>  '6025',             // 端口
    'prefix'			=>  'jh_',              // 数据库表前缀
    'debug'				=>  TRUE,               // 数据库调试模式 开启后可以记录SQL日志
    'fields_cache'		=>  false,              // 启用字段缓存
    'charset'			=>  'utf8mb4',             // 数据库编码默认采用utf8

);
